---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsPipeStaticPressure
source: html/62dd9abe-ce65-1dea-958f-d5ef23538870.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsPipeStaticPressure Property

"Static Pressure"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsPipeStaticPressure { get; }
```